app/controllers/photos_controller.rb

  def create
    photo = Photo.create(params[:photo])
    album = Album.find(params[:album_id])
---
INSERT INTO "photos" ("album_id", "created_at", "name", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["album_id", nil], ["created_at", Wed, 20 Mar 2013 14:51:14 UTC +00:00], ["name", ""], ["updated_at", Wed, 20 Mar 2013 14:51:14 UTC +00:00], ["url", "Puppy.jpg"]]
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", "1"]]